#  Требуется вычислить, сколько раз встречается некоторое
# число X в массиве A[1..N]. Пользователь в первой строке вводит
# натуральное число N – количество элементов в массиве. В последующих
# строках записаны N целых чисел Ai
# . Последняя строка содержит число X
# 5
# 1 2 3 4 5
# 3
# -> 1
n = int(input("Сколько чисел желаете ввести?: "))
nums = []
for i in range(n):
    nums.append(int(input('Введите число: ')))
print(nums)
x = int(input('Какое число ищем?: '))
count = 0
for i in nums:
    if i == x:
        count += 1
print(f'Число {x} встречается {count} раз(а)')
